projects/app/Http/Controllers/PageController.php

select * from `host_away_properties` where `host_away_properties`.`id` = '3' limit 1
select * from `host_away_dates` where (`hostaway_id` = '338803' and `single_date` = '2025-08-18')
---
    public function checkAjaxGetQuoteData(Request $request){
        if($request->property_id){
            $property=HostAwayProperty::find($request->property_id);
            if($request->start_date){
                if($request->end_date){
                    $total_guest=$request->adults+$request->childs;
                  	$minimum_stay=0;
                    $now = strtotime($request->get("start_date"));
                    $your_date = strtotime($request->get("end_date"));
                    $datediff =  $your_date-$now;
                    $day= ceil($datediff / (60 * 60 * 24));
                    $total_night=$day;
                    $date = strtotime(($request->get("start_date")));
                    $date= date('Y-m-d', $date);
                	foreach(HostAwayDate::where(["hostaway_id"=>$property->host_away_id,"single_date"=>$date])->get() as $c){

select * from `host_away_properties` where `host_away_properties`.`id` = '3' limit 1
select * from `host_away_dates` where (`hostaway_id` = '338803' and `single_date` = '2025-08-18')
---
    public function dynamicDataCategory(Request $request,$seo_url){
        if($seo_url=="home"){ return redirect("/"); }
        $data=Cms::where("seo_url",$seo_url)->first();
        if($data){
            $templete="front.static.".$data->templete;
            if($data->templete=="blogs"){
                $blogs=Blog::orderBy("id","desc")->paginate(12);
                return view($templete,compact("data","blogs"));
            }else if($data->templete=="get-quote"){
                $start_date=Helper::getDateFormatData($request->start_date);
                $end_date=Helper::getDateFormatData($request->end_date);
                $total_guest=$request->adults+$request->child;
                $property=HostAwayProperty::find($request->property_id);
                if($property){
                    $minimum_stay=0;
                    $now = strtotime(Helper::getDateFormatData($request->get("start_date")));
                    $your_date = strtotime(Helper::getDateFormatData($request->get("end_date")));
                    $datediff =  $your_date-$now;
                    $day= ceil($datediff / (60 * 60 * 24));
                    $total_night=$day;
                    $date = strtotime(Helper::getDateFormatData($request->get("start_date")));
                    $date= date('Y-m-d', $date);
                    foreach(HostAwayDate::where(["hostaway_id"=>$property->host_away_id,"single_date"=>$date])->get() as $c){

select * from `host_away_properties` where `seo_url` = 'twin-treat-near-blue-mountain-338803' limit 1
---
                return view($templete,compact("data"));
           }
        }
        $data=HostAwayProperty::where("seo_url",$seo_url)->first();