projects/app/Helper/HostAwayAPI.php

    public function getBearerToken(){
        $token='';
        $setting=BasicSetting::where("name","HostAwayToken")->first();
---
select * from `basic_settings` where `name` = 'HostAwayToken' limit 1