projects/app/Helper/LiveCart.php

   public function iCalDataCheckInCheckOut($property_id){
        $abc=HostAwayProperty::find($property_id);
        if($abc):
            $data=HostAwayBooking::where(['listingMapId'=>$abc->host_away_id])->whereIn("status",["new","modified","ownerStay"])->where("departureDate",">",date('Y-m-d'))->get();
---
select * from `host_away_properties` where `host_away_properties`.`id` = '4' limit 1
select * from `host_away_bookings` where (`listingMapId` = '338804') and `status` in ('new', 'modified', 'ownerStay') and `departureDate` > '2025-07-28'

    public function iCalDataCheckInCheckOutCheckinCheckout($property_id){
        $data=IcalEvent::where(['event_pid'=>$property_id])->where("end_date",">",date('Y-m-d'))->get();
        $checkin=[];
        $checkout=[];
        $blocked=[];
        foreach($data as $row){
            $checkin[]=$row->start_date;
            $checkout[]=$row->end_date;
            $todate = date('Y-m-d',strtotime($row->end_date));
            $fdate = date('Y-m-d',strtotime($row->start_date));
            $now = strtotime($row->start_date);
            $your_date = strtotime($row->end_date);
            $datediff =  $your_date-$now;
            $day= ceil($datediff / (60 * 60 * 24));
            for($i=1;$i<$day;$i++){
                $date = strtotime($row->start_date);
                $date = strtotime("+".$i." day", $date);
                $blocked[]= date('Y-m-d', $date);
            }
        }
        $abc=HostAwayProperty::find($property_id);
        if($abc):
            $data=HostAwayBooking::where(['listingMapId'=>$abc->host_away_id])->whereIn("status",["new","modified","ownerStay"])->where("departureDate",">",date('Y-m-d'))->get();
---
select * from `ical_events` where (`event_pid` = 3) and `end_date` > '2025-07-28'
select * from `host_away_properties` where `host_away_properties`.`id` = 3 limit 1
select * from `host_away_bookings` where (`listingMapId` = '338803') and `status` in ('new', 'modified', 'ownerStay') and `departureDate` > '2025-07-28'

                $blocked[]=$b->single_date;
            } **/

            $unavailable_dates = HostAwayDate::where("hostaway_id", $abc->host_away_id)
                  ->whereIn("status", ["blocked","reserved"])
                  ->orderBy("single_date")
                  ->pluck("single_date")  // Get only the dates
                  ->map(fn($d) => \Carbon\Carbon::parse($d)->toDateString())  // Convert to Y-m-d
                  ->unique()
                  ->values()
                  ->toArray();
---
select `single_date` from `host_away_dates` where `hostaway_id` = '338803' and `status` in ('blocked', 'reserved') order by `single_date` asc